MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0L2228-Q1/mcu.h
/* IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM42_PF_I2C2_SDA                     ((uint32_t)0X00000006)
#define IOMUX_PINCM42_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000007)
#define IOMUX_PINCM42_PF_TIMG12_CCP1                  ((uint32_t)0X00000008)
#define IOMUX_PINCM42_PF_LCD_LCDSON                   ((uint32_t)0X00000009)
#define IOMUX_PINCM42_PF_UART2_CTS                    ((uint32_t)0X0000000A)

/* IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOC_DIO00                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_TIMG8_CCP0                   ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)

/* IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOC_DIO01                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)

/* IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOC_DIO02                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_I2C2_SCL                     ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_SPI1_CS0                     ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_TIMA_FAULT0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM45_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)

/* IOMUX_PINCM46[PF] Bits */
#define IOMUX_PINCM46_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM46_PF_GPIOC_DIO03                  ((uint32_t)0X00000001)
#define IOMUX_PINCM46_PF_I2C2_SDA                     ((uint32_t)0X00000002)
#define IOMUX_PINCM46_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000003)
#define IOMUX_PINCM46_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM46_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM46_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM47[PF] Bits */
#define IOMUX_PINCM47_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM47_PF_GPIOC_DIO04                  ((uint32_t)0X00000001)
#define IOMUX_PINCM47_PF_UART3_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM47_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM47_PF_TIMA_FAULT2                  ((uint32_t)0X00000004)
#define IOMUX_PINCM47_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM47_PF_TIMG4_CCP0                   ((uint32_t)0X00000006)

/* IOMUX_PINCM48[PF] Bits */
#define IOMUX_PINCM48_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM48_PF_GPIOC_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM48_PF_UART3_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM48_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM48_PF_TIMG8_IDX                    ((uint32_t)0X00000004)
#define IOMUX_PINCM48_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM48_PF_TIMG4_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM49[PF] Bits */
#define IOMUX_PINCM49_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM49_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM49_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM49_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM49_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM49_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM49_PF_TIMG5_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM49_PF_TIMG8_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM49_PF_TIMG12_CCP0                  ((uint32_t)0X00000008)
#define IOMUX_PINCM49_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000009)
#define IOMUX_PINCM49_PF_LCD_LCDLFCLK                 ((uint32_t)0X0000000A)

/* IOMUX_PINCM50[PF] Bits */
#define IOMUX_PINCM50_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM50_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM50_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM50_PF_SPI1_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM50_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM50_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM50_PF_TIMG5_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM50_PF_TIMG8_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM50_PF_TIMG12_CCP1                  ((uint32_t)0X00000008)
#define IOMUX_PINCM50_PF_SPI0_CS0                     ((uint32_t)0X00000009)
#define IOMUX_PINCM50_PF_LCD_LCDEN                    ((uint32_t)0X0000000A)

/* IOMUX_PINCM51[PF] Bits */
#define IOMUX_PINCM51_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM51_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM51_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM51_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM51_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM51_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM51_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)

/* IOMUX_PINCM52[PF] Bits */
#define IOMUX_PINCM52_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM52_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM52_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM52_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM52_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM52_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM52_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM53[PF] Bits */
#define IOMUX_PINCM53_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM53_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM53_PF_UART2_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM53_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM53_PF_I2C0_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM53_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM53_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM53_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM53_PF_UART4_TX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM53_PF_TIMG4_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM53_PF_LCD_LCDSON                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM54[PF] Bits */
#define IOMUX_PINCM54_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM54_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM54_PF_UART2_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM54_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM54_PF_I2C0_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM54_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM54_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM54_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000007)
#define IOMUX_PINCM54_PF_UART4_RX                     ((uint32_t)0X00000008)
#define IOMUX_PINCM54_PF_TIMG4_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM54_PF_LCD_LCDLFCLK                 ((uint32_t)0X0000000A)

/* IOMUX_PINCM55[PF] Bits */
#define IOMUX_PINCM55_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM55_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM55_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM55_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM55_PF_TIMG8_CCP1                   ((uint32_t)0X00000004)
#define IOMUX_PINCM55_PF_UART0_CTS                    ((uint32_t)0X00000005)
#define IOMUX_PINCM55_PF_TIMG5_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM55_PF_TIMG8_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM55_PF_UART2_CTS                    ((uint32_t)0X00000008)
#define IOMUX_PINCM55_PF_UART4_CTS                    ((uint32_t)0X00000009)
#define IOMUX_PINCM55_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X0000000A)

